# Homebrew is the "missing package manager for macOS".  Read more here: https://brew.sh/
# Explore packages available by browsing to http://brewformulas.org/.
# Use this script to customize your Strap setup with packages you like!

# Some examples:
# Use `cask "{package}"` format for items installed with `brew install Caskroom/cask/{package}`
# cask "{package}"

# Use `brew "{package}"` format for packages installed with `brew install {package}`
# brew "{package}"
#

#tap "boxen/brews"
tap "caskroom/drivers"
#tap "homebrew/versions"
#brew "ack"
##brew "augeas"
brew "awscli"
brew "awslogs"
brew "bash"
brew "bash-git-prompt"
#brew "coreutils"
brew "findutils"
#brew "freetds"
brew "fswatch"
brew "git"
#brew "gmp"
brew "gnu-tar"
brew "grep"
#brew "isl@0.14"
#brew "mpfr"
#brew "libmpc"
#brew "libxml2"
brew "mas"
brew "mongodb"
#brew "mono"
brew "p7zip"
#brew "packer"
#brew "poppler"
#brew "scons"
#brew "boxen/brews/gcc5"

cask "amazon-music"
#cask "box-sync"
cask "dotnet-sdk"
#cask "flash"
cask "flash-npapi"
#cask "lastpass" - removed from brew in favor of mas
cask "logitech-control-center"
cask "logitech-unifying"
cask "microsoft-office"
cask "mightytext"
cask "muzzle"
#cask "onedrive"
cask "osxfuse"
#cask "p4merge" - merged into p4v
cask "p4v"
cask "powershell"
#cask "razer-synapse"
cask "royal-tsx"
#cask "scribus"
cask "spectacle"
cask "steam"
cask "steelseries-engine"
cask "suspicious-package"
cask "vanilla"
cask "veracrypt"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
