# Homebrew is the "missing package manager for macOS".  Read more here: https://brew.sh/
# Explore packages available by browsing to http://brewformulas.org/.
# Use this script to customize your Strap setup with packages you like!

# Some examples:
# Use `cask "{package}"` format for items installed with `brew install Caskroom/cask/{package}`
# cask "{package}"

# Use `brew "{package}"` format for packages installed with `brew install {package}`
# brew "{package}"
#

#tap "boxen/brews"
#tap "homebrew/versions"
tap "homebrew/cask-drivers"
tap "jesseduffield/lazydocker"
tap "skanehira/docui"

#brew "ack"
##brew "augeas"
brew "awscli"
brew "awslogs"
brew "bash"
brew "bash-git-prompt"
#brew "coreutils"
brew "docui"
brew "findutils"
#brew "freetds"
brew "fswatch"
brew "git"
#brew "gmp"
brew "gnu-tar"
brew "grep"
#brew "isl@0.14"
#brew "mpfr"
brew "lazydocker"
#brew "libmpc"
#brew "libxml2"
brew "mas"
#brew "mongodb"  # deleted?
#brew "mono"
brew "p7zip"
#brew "packer"
#brew "poppler"
#brew "scons"
#brew "boxen/brews/gcc5"

cask "amazon-music"
cask "dotnet-sdk"
cask "firefox"
cask "flash-npapi"
cask "google-backup-and-sync" #use for personal acct
cask "google-chrome"
#cask "google-drive-file-stream" #use for cp acct
cask "logitech-control-center"
#cask "logitech-unifying" #appears to be builtin? as of 2019-07-08, pkg wasn't compatible with Mojave
cask "microsoft-azure-storage-explorer"
cask "microsoft-office"
#cask "mightytext"
cask "muzzle"
cask "onedrive"
cask "osxfuse"
cask "p4v" #p4merge
cask "powershell"
#cask "razer-synapse"
cask "royal-tsx"
#cask "scribus"
cask "spectacle"
cask "steam"
#cask "steelseries-engine"
cask "suspicious-package" #extracts .pkg files
cask "vanilla"
cask "veracrypt"
cask "visual-studio-code"
cask "vlc"
#cask "whatsapp"
cask "zoomus"
cask "zoomus-outlook-plugin"
